7767517
177 200
Input            data             0 1 data 0=320 1=320 2=3
Split            splitncnn_0      1 7 data data_splitncnn_0 data_splitncnn_1 data_splitncnn_2 data_splitncnn_3 data_splitncnn_4 data_splitncnn_5 data_splitncnn_6
Convolution      conv1            1 1 data_splitncnn_6 conv1 0=32 1=3 2=1 3=2 4=1 5=0 6=864
BatchNorm        conv1/bn         1 1 conv1 conv1_conv1/bn 0=32
Scale            conv1/scale      1 1 conv1_conv1/bn conv1_conv1/scale 0=32 1=1
ReLU             relu1            1 1 conv1_conv1/scale conv1_relu1
ConvolutionDepthWise conv2_1/dw       1 1 conv1_relu1 conv2_1/dw 0=32 1=3 2=1 3=1 4=1 5=0 6=288 7=32
BatchNorm        conv2_1/dw/bn    1 1 conv2_1/dw conv2_1/dw_conv2_1/dw/bn 0=32
Scale            conv2_1/dw/scale 1 1 conv2_1/dw_conv2_1/dw/bn conv2_1/dw_conv2_1/dw/scale 0=32 1=1
ReLU             relu2_1/dw       1 1 conv2_1/dw_conv2_1/dw/scale conv2_1/dw_relu2_1/dw
Convolution      conv2_1/sep      1 1 conv2_1/dw_relu2_1/dw conv2_1/sep 0=64 1=1 2=1 3=1 4=0 5=0 6=2048
BatchNorm        conv2_1/sep/bn   1 1 conv2_1/sep conv2_1/sep_conv2_1/sep/bn 0=64
Scale            conv2_1/sep/scale 1 1 conv2_1/sep_conv2_1/sep/bn conv2_1/sep_conv2_1/sep/scale 0=64 1=1
ReLU             relu2_1/sep      1 1 conv2_1/sep_conv2_1/sep/scale conv2_1/sep_relu2_1/sep
ConvolutionDepthWise conv2_2/dw       1 1 conv2_1/sep_relu2_1/sep conv2_2/dw 0=64 1=3 2=1 3=2 4=1 5=0 6=576 7=64
BatchNorm        conv2_2/dw/bn    1 1 conv2_2/dw conv2_2/dw_conv2_2/dw/bn 0=64
Scale            conv2_2/dw/scale 1 1 conv2_2/dw_conv2_2/dw/bn conv2_2/dw_conv2_2/dw/scale 0=64 1=1
ReLU             relu2_2/dw       1 1 conv2_2/dw_conv2_2/dw/scale conv2_2/dw_relu2_2/dw
Convolution      conv2_2/sep      1 1 conv2_2/dw_relu2_2/dw conv2_2/sep 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        conv2_2/sep/bn   1 1 conv2_2/sep conv2_2/sep_conv2_2/sep/bn 0=128
Scale            conv2_2/sep/scale 1 1 conv2_2/sep_conv2_2/sep/bn conv2_2/sep_conv2_2/sep/scale 0=128 1=1
ReLU             relu2_2/sep      1 1 conv2_2/sep_conv2_2/sep/scale conv2_2/sep_relu2_2/sep
ConvolutionDepthWise conv3_1/dw       1 1 conv2_2/sep_relu2_2/sep conv3_1/dw 0=128 1=3 2=1 3=1 4=1 5=0 6=1152 7=128
BatchNorm        conv3_1/dw/bn    1 1 conv3_1/dw conv3_1/dw_conv3_1/dw/bn 0=128
Scale            conv3_1/dw/scale 1 1 conv3_1/dw_conv3_1/dw/bn conv3_1/dw_conv3_1/dw/scale 0=128 1=1
ReLU             relu3_1/dw       1 1 conv3_1/dw_conv3_1/dw/scale conv3_1/dw_relu3_1/dw
Convolution      conv3_1/sep      1 1 conv3_1/dw_relu3_1/dw conv3_1/sep 0=128 1=1 2=1 3=1 4=0 5=0 6=16384
BatchNorm        conv3_1/sep/bn   1 1 conv3_1/sep conv3_1/sep_conv3_1/sep/bn 0=128
Scale            conv3_1/sep/scale 1 1 conv3_1/sep_conv3_1/sep/bn conv3_1/sep_conv3_1/sep/scale 0=128 1=1
ReLU             relu3_1/sep      1 1 conv3_1/sep_conv3_1/sep/scale conv3_1/sep_relu3_1/sep
ConvolutionDepthWise conv3_2/dw       1 1 conv3_1/sep_relu3_1/sep conv3_2/dw 0=128 1=3 2=1 3=2 4=1 5=0 6=1152 7=128
BatchNorm        conv3_2/dw/bn    1 1 conv3_2/dw conv3_2/dw_conv3_2/dw/bn 0=128
Scale            conv3_2/dw/scale 1 1 conv3_2/dw_conv3_2/dw/bn conv3_2/dw_conv3_2/dw/scale 0=128 1=1
ReLU             relu3_2/dw       1 1 conv3_2/dw_conv3_2/dw/scale conv3_2/dw_relu3_2/dw
Convolution      conv3_2/sep      1 1 conv3_2/dw_relu3_2/dw conv3_2/sep 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        conv3_2/sep/bn   1 1 conv3_2/sep conv3_2/sep_conv3_2/sep/bn 0=256
Scale            conv3_2/sep/scale 1 1 conv3_2/sep_conv3_2/sep/bn conv3_2/sep_conv3_2/sep/scale 0=256 1=1
ReLU             relu3_2/sep      1 1 conv3_2/sep_conv3_2/sep/scale conv3_2/sep_relu3_2/sep
ConvolutionDepthWise conv4_1/dw       1 1 conv3_2/sep_relu3_2/sep conv4_1/dw 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        conv4_1/dw/bn    1 1 conv4_1/dw conv4_1/dw_conv4_1/dw/bn 0=256
Scale            conv4_1/dw/scale 1 1 conv4_1/dw_conv4_1/dw/bn conv4_1/dw_conv4_1/dw/scale 0=256 1=1
ReLU             relu4_1/dw       1 1 conv4_1/dw_conv4_1/dw/scale conv4_1/dw_relu4_1/dw
Convolution      conv4_1/sep      1 1 conv4_1/dw_relu4_1/dw conv4_1/sep 0=256 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        conv4_1/sep/bn   1 1 conv4_1/sep conv4_1/sep_conv4_1/sep/bn 0=256
Scale            conv4_1/sep/scale 1 1 conv4_1/sep_conv4_1/sep/bn conv4_1/sep_conv4_1/sep/scale 0=256 1=1
ReLU             relu4_1/sep      1 1 conv4_1/sep_conv4_1/sep/scale conv4_1/sep_relu4_1/sep
Split            splitncnn_1      1 4 conv4_1/sep_relu4_1/sep conv4_1/sep_relu4_1/sep_splitncnn_0 conv4_1/sep_relu4_1/sep_splitncnn_1 conv4_1/sep_relu4_1/sep_splitncnn_2 conv4_1/sep_relu4_1/sep_splitncnn_3
ConvolutionDepthWise conv4_2/dw       1 1 conv4_1/sep_relu4_1/sep_splitncnn_3 conv4_2/dw 0=256 1=3 2=1 3=2 4=1 5=0 6=2304 7=256
BatchNorm        conv4_2/dw/bn    1 1 conv4_2/dw conv4_2/dw_conv4_2/dw/bn 0=256
Scale            conv4_2/dw/scale 1 1 conv4_2/dw_conv4_2/dw/bn conv4_2/dw_conv4_2/dw/scale 0=256 1=1
ReLU             relu4_2/dw       1 1 conv4_2/dw_conv4_2/dw/scale conv4_2/dw_relu4_2/dw
Convolution      conv4_2/sep      1 1 conv4_2/dw_relu4_2/dw conv4_2/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=131072
BatchNorm        conv4_2/sep/bn   1 1 conv4_2/sep conv4_2/sep_conv4_2/sep/bn 0=512
Scale            conv4_2/sep/scale 1 1 conv4_2/sep_conv4_2/sep/bn conv4_2/sep_conv4_2/sep/scale 0=512 1=1
ReLU             relu4_2/sep      1 1 conv4_2/sep_conv4_2/sep/scale conv4_2/sep_relu4_2/sep
ConvolutionDepthWise conv5_1/dw       1 1 conv4_2/sep_relu4_2/sep conv5_1/dw 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        conv5_1/dw/bn    1 1 conv5_1/dw conv5_1/dw_conv5_1/dw/bn 0=512
Scale            conv5_1/dw/scale 1 1 conv5_1/dw_conv5_1/dw/bn conv5_1/dw_conv5_1/dw/scale 0=512 1=1
ReLU             relu5_1/dw       1 1 conv5_1/dw_conv5_1/dw/scale conv5_1/dw_relu5_1/dw
Convolution      conv5_1/sep      1 1 conv5_1/dw_relu5_1/dw conv5_1/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=262144
BatchNorm        conv5_1/sep/bn   1 1 conv5_1/sep conv5_1/sep_conv5_1/sep/bn 0=512
Scale            conv5_1/sep/scale 1 1 conv5_1/sep_conv5_1/sep/bn conv5_1/sep_conv5_1/sep/scale 0=512 1=1
ReLU             relu5_1/sep      1 1 conv5_1/sep_conv5_1/sep/scale conv5_1/sep_relu5_1/sep
ConvolutionDepthWise conv5_2/dw       1 1 conv5_1/sep_relu5_1/sep conv5_2/dw 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        conv5_2/dw/bn    1 1 conv5_2/dw conv5_2/dw_conv5_2/dw/bn 0=512
Scale            conv5_2/dw/scale 1 1 conv5_2/dw_conv5_2/dw/bn conv5_2/dw_conv5_2/dw/scale 0=512 1=1
ReLU             relu5_2/dw       1 1 conv5_2/dw_conv5_2/dw/scale conv5_2/dw_relu5_2/dw
Convolution      conv5_2/sep      1 1 conv5_2/dw_relu5_2/dw conv5_2/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=262144
BatchNorm        conv5_2/sep/bn   1 1 conv5_2/sep conv5_2/sep_conv5_2/sep/bn 0=512
Scale            conv5_2/sep/scale 1 1 conv5_2/sep_conv5_2/sep/bn conv5_2/sep_conv5_2/sep/scale 0=512 1=1
ReLU             relu5_2/sep      1 1 conv5_2/sep_conv5_2/sep/scale conv5_2/sep_relu5_2/sep
ConvolutionDepthWise conv5_3/dw       1 1 conv5_2/sep_relu5_2/sep conv5_3/dw 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        conv5_3/dw/bn    1 1 conv5_3/dw conv5_3/dw_conv5_3/dw/bn 0=512
Scale            conv5_3/dw/scale 1 1 conv5_3/dw_conv5_3/dw/bn conv5_3/dw_conv5_3/dw/scale 0=512 1=1
ReLU             relu5_3/dw       1 1 conv5_3/dw_conv5_3/dw/scale conv5_3/dw_relu5_3/dw
Convolution      conv5_3/sep      1 1 conv5_3/dw_relu5_3/dw conv5_3/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=262144
BatchNorm        conv5_3/sep/bn   1 1 conv5_3/sep conv5_3/sep_conv5_3/sep/bn 0=512
Scale            conv5_3/sep/scale 1 1 conv5_3/sep_conv5_3/sep/bn conv5_3/sep_conv5_3/sep/scale 0=512 1=1
ReLU             relu5_3/sep      1 1 conv5_3/sep_conv5_3/sep/scale conv5_3/sep_relu5_3/sep
ConvolutionDepthWise conv5_4/dw       1 1 conv5_3/sep_relu5_3/sep conv5_4/dw 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        conv5_4/dw/bn    1 1 conv5_4/dw conv5_4/dw_conv5_4/dw/bn 0=512
Scale            conv5_4/dw/scale 1 1 conv5_4/dw_conv5_4/dw/bn conv5_4/dw_conv5_4/dw/scale 0=512 1=1
ReLU             relu5_4/dw       1 1 conv5_4/dw_conv5_4/dw/scale conv5_4/dw_relu5_4/dw
Convolution      conv5_4/sep      1 1 conv5_4/dw_relu5_4/dw conv5_4/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=262144
BatchNorm        conv5_4/sep/bn   1 1 conv5_4/sep conv5_4/sep_conv5_4/sep/bn 0=512
Scale            conv5_4/sep/scale 1 1 conv5_4/sep_conv5_4/sep/bn conv5_4/sep_conv5_4/sep/scale 0=512 1=1
ReLU             relu5_4/sep      1 1 conv5_4/sep_conv5_4/sep/scale conv5_4/sep_relu5_4/sep
ConvolutionDepthWise conv5_5/dw       1 1 conv5_4/sep_relu5_4/sep conv5_5/dw 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        conv5_5/dw/bn    1 1 conv5_5/dw conv5_5/dw_conv5_5/dw/bn 0=512
Scale            conv5_5/dw/scale 1 1 conv5_5/dw_conv5_5/dw/bn conv5_5/dw_conv5_5/dw/scale 0=512 1=1
ReLU             relu5_5/dw       1 1 conv5_5/dw_conv5_5/dw/scale conv5_5/dw_relu5_5/dw
Convolution      conv5_5/sep      1 1 conv5_5/dw_relu5_5/dw conv5_5/sep 0=512 1=1 2=1 3=1 4=0 5=0 6=262144
BatchNorm        conv5_5/sep/bn   1 1 conv5_5/sep conv5_5/sep_conv5_5/sep/bn 0=512
Scale            conv5_5/sep/scale 1 1 conv5_5/sep_conv5_5/sep/bn conv5_5/sep_conv5_5/sep/scale 0=512 1=1
ReLU             relu5_5/sep      1 1 conv5_5/sep_conv5_5/sep/scale conv5_5/sep_relu5_5/sep
Split            splitncnn_2      1 4 conv5_5/sep_relu5_5/sep conv5_5/sep_relu5_5/sep_splitncnn_0 conv5_5/sep_relu5_5/sep_splitncnn_1 conv5_5/sep_relu5_5/sep_splitncnn_2 conv5_5/sep_relu5_5/sep_splitncnn_3
ConvolutionDepthWise conv5_6/dw       1 1 conv5_5/sep_relu5_5/sep_splitncnn_3 conv5_6/dw 0=512 1=3 2=1 3=2 4=1 5=0 6=4608 7=512
BatchNorm        conv5_6/dw/bn    1 1 conv5_6/dw conv5_6/dw_conv5_6/dw/bn 0=512
Scale            conv5_6/dw/scale 1 1 conv5_6/dw_conv5_6/dw/bn conv5_6/dw_conv5_6/dw/scale 0=512 1=1
ReLU             relu5_6/dw       1 1 conv5_6/dw_conv5_6/dw/scale conv5_6/dw_relu5_6/dw
Convolution      conv5_6/sep      1 1 conv5_6/dw_relu5_6/dw conv5_6/sep 0=1024 1=1 2=1 3=1 4=0 5=0 6=524288
BatchNorm        conv5_6/sep/bn   1 1 conv5_6/sep conv5_6/sep_conv5_6/sep/bn 0=1024
Scale            conv5_6/sep/scale 1 1 conv5_6/sep_conv5_6/sep/bn conv5_6/sep_conv5_6/sep/scale 0=1024 1=1
ReLU             relu5_6/sep      1 1 conv5_6/sep_conv5_6/sep/scale conv5_6/sep_relu5_6/sep
ConvolutionDepthWise conv6/dw         1 1 conv5_6/sep_relu5_6/sep conv6/dw 0=1024 1=3 2=1 3=1 4=1 5=0 6=9216 7=1024
BatchNorm        conv6/dw/bn      1 1 conv6/dw conv6/dw_conv6/dw/bn 0=1024
Scale            conv6/dw/scale   1 1 conv6/dw_conv6/dw/bn conv6/dw_conv6/dw/scale 0=1024 1=1
ReLU             relu6/dw         1 1 conv6/dw_conv6/dw/scale conv6/dw_relu6/dw
Convolution      conv6/sep        1 1 conv6/dw_relu6/dw conv6/sep 0=1024 1=1 2=1 3=1 4=0 5=0 6=1048576
BatchNorm        conv6/sep/bn     1 1 conv6/sep conv6/sep_conv6/sep/bn 0=1024
Scale            conv6/sep/scale  1 1 conv6/sep_conv6/sep/bn conv6/sep_conv6/sep/scale 0=1024 1=1
ReLU             relu6/sep        1 1 conv6/sep_conv6/sep/scale conv6/sep_relu6/sep
Split            splitncnn_3      1 4 conv6/sep_relu6/sep conv6/sep_relu6/sep_splitncnn_0 conv6/sep_relu6/sep_splitncnn_1 conv6/sep_relu6/sep_splitncnn_2 conv6/sep_relu6/sep_splitncnn_3
Convolution      conv7_1          1 1 conv6/sep_relu6/sep_splitncnn_3 conv7_1 0=128 1=1 2=1 3=1 4=0 5=1 6=131072
ReLU             conv7_1_relu     1 1 conv7_1 conv7_1_conv7_1_relu
Convolution      conv7_2          1 1 conv7_1_conv7_1_relu conv7_2 0=256 1=3 2=1 3=2 4=1 5=1 6=294912
ReLU             conv7_2_relu     1 1 conv7_2 conv7_2_conv7_2_relu
Split            splitncnn_4      1 4 conv7_2_conv7_2_relu conv7_2_conv7_2_relu_splitncnn_0 conv7_2_conv7_2_relu_splitncnn_1 conv7_2_conv7_2_relu_splitncnn_2 conv7_2_conv7_2_relu_splitncnn_3
Convolution      conv8_1          1 1 conv7_2_conv7_2_relu_splitncnn_3 conv8_1 0=128 1=1 2=1 3=1 4=0 5=1 6=32768
ReLU             conv8_1_relu     1 1 conv8_1 conv8_1_conv8_1_relu
Convolution      conv8_2          1 1 conv8_1_conv8_1_relu conv8_2 0=256 1=3 2=1 3=1 4=0 5=1 6=294912
ReLU             conv8_2_relu     1 1 conv8_2 conv8_2_conv8_2_relu
Split            splitncnn_5      1 4 conv8_2_conv8_2_relu conv8_2_conv8_2_relu_splitncnn_0 conv8_2_conv8_2_relu_splitncnn_1 conv8_2_conv8_2_relu_splitncnn_2 conv8_2_conv8_2_relu_splitncnn_3
Convolution      conv9_1          1 1 conv8_2_conv8_2_relu_splitncnn_3 conv9_1 0=128 1=1 2=1 3=1 4=0 5=1 6=32768
ReLU             conv9_1_relu     1 1 conv9_1 conv9_1_conv9_1_relu
Convolution      conv9_2          1 1 conv9_1_conv9_1_relu conv9_2 0=256 1=3 2=1 3=1 4=0 5=1 6=294912
ReLU             conv9_2_relu     1 1 conv9_2 conv9_2_conv9_2_relu
Split            splitncnn_6      1 3 conv9_2_conv9_2_relu conv9_2_conv9_2_relu_splitncnn_0 conv9_2_conv9_2_relu_splitncnn_1 conv9_2_conv9_2_relu_splitncnn_2
Convolution      conv4_1/sep_mbox_loc 1 1 conv4_1/sep_relu4_1/sep_splitncnn_2 conv4_1/sep_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=36864
Permute          conv4_1/sep_mbox_loc_perm 1 1 conv4_1/sep_mbox_loc conv4_1/sep_mbox_loc_perm 0=3
Flatten          conv4_1/sep_mbox_loc_flat 1 1 conv4_1/sep_mbox_loc_perm conv4_1/sep_mbox_loc_flat
Convolution      conv4_1/sep_mbox_conf 1 1 conv4_1/sep_relu4_1/sep_splitncnn_1 conv4_1/sep_mbox_conf 0=84 1=3 2=1 3=1 4=1 5=1 6=193536
Permute          conv4_1/sep_mbox_conf_perm 1 1 conv4_1/sep_mbox_conf conv4_1/sep_mbox_conf_perm 0=3
Flatten          conv4_1/sep_mbox_conf_flat 1 1 conv4_1/sep_mbox_conf_perm conv4_1/sep_mbox_conf_flat
PriorBox         conv4_1/sep_mbox_priorbox 2 1 conv4_1/sep_relu4_1/sep_splitncnn_0 data_splitncnn_5 conv4_1/sep_mbox_priorbox -23300=1,22.400000 -23301=1,48.000000 -23302=1,2.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=8.000000 12=8.000000 13=0.500000
Convolution      conv5_5/sep_mbox_loc 1 1 conv5_5/sep_relu5_5/sep_splitncnn_2 conv5_5/sep_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=110592
Permute          conv5_5/sep_mbox_loc_perm 1 1 conv5_5/sep_mbox_loc conv5_5/sep_mbox_loc_perm 0=3
Flatten          conv5_5/sep_mbox_loc_flat 1 1 conv5_5/sep_mbox_loc_perm conv5_5/sep_mbox_loc_flat
Convolution      conv5_5/sep_mbox_conf 1 1 conv5_5/sep_relu5_5/sep_splitncnn_1 conv5_5/sep_mbox_conf 0=126 1=3 2=1 3=1 4=1 5=1 6=580608
Permute          conv5_5/sep_mbox_conf_perm 1 1 conv5_5/sep_mbox_conf conv5_5/sep_mbox_conf_perm 0=3
Flatten          conv5_5/sep_mbox_conf_flat 1 1 conv5_5/sep_mbox_conf_perm conv5_5/sep_mbox_conf_flat
PriorBox         conv5_5/sep_mbox_priorbox 2 1 conv5_5/sep_relu5_5/sep_splitncnn_0 data_splitncnn_4 conv5_5/sep_mbox_priorbox -23300=1,48.000000 -23301=1,105.599998 -23302=2,2.000000,3.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=16.000000 12=16.000000 13=0.500000
Convolution      conv6/sep_mbox_loc 1 1 conv6/sep_relu6/sep_splitncnn_2 conv6/sep_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=221184
Permute          conv6/sep_mbox_loc_perm 1 1 conv6/sep_mbox_loc conv6/sep_mbox_loc_perm 0=3
Flatten          conv6/sep_mbox_loc_flat 1 1 conv6/sep_mbox_loc_perm conv6/sep_mbox_loc_flat
Convolution      conv6/sep_mbox_conf 1 1 conv6/sep_relu6/sep_splitncnn_1 conv6/sep_mbox_conf 0=126 1=3 2=1 3=1 4=1 5=1 6=1161216
Permute          conv6/sep_mbox_conf_perm 1 1 conv6/sep_mbox_conf conv6/sep_mbox_conf_perm 0=3
Flatten          conv6/sep_mbox_conf_flat 1 1 conv6/sep_mbox_conf_perm conv6/sep_mbox_conf_flat
PriorBox         conv6/sep_mbox_priorbox 2 1 conv6/sep_relu6/sep_splitncnn_0 data_splitncnn_3 conv6/sep_mbox_priorbox -23300=1,105.599998 -23301=1,163.199997 -23302=2,2.000000,3.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=32.000000 12=32.000000 13=0.500000
Convolution      conv7_2_mbox_loc 1 1 conv7_2_conv7_2_relu_splitncnn_2 conv7_2_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=55296
Permute          conv7_2_mbox_loc_perm 1 1 conv7_2_mbox_loc conv7_2_mbox_loc_perm 0=3
Flatten          conv7_2_mbox_loc_flat 1 1 conv7_2_mbox_loc_perm conv7_2_mbox_loc_flat
Convolution      conv7_2_mbox_conf 1 1 conv7_2_conv7_2_relu_splitncnn_1 conv7_2_mbox_conf 0=126 1=3 2=1 3=1 4=1 5=1 6=290304
Permute          conv7_2_mbox_conf_perm 1 1 conv7_2_mbox_conf conv7_2_mbox_conf_perm 0=3
Flatten          conv7_2_mbox_conf_flat 1 1 conv7_2_mbox_conf_perm conv7_2_mbox_conf_flat
PriorBox         conv7_2_mbox_priorbox 2 1 conv7_2_conv7_2_relu_splitncnn_0 data_splitncnn_2 conv7_2_mbox_priorbox -23300=1,163.199997 -23301=1,220.800003 -23302=2,2.000000,3.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=64.000000 12=64.000000 13=0.500000
Convolution      conv8_2_mbox_loc 1 1 conv8_2_conv8_2_relu_splitncnn_2 conv8_2_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=36864
Permute          conv8_2_mbox_loc_perm 1 1 conv8_2_mbox_loc conv8_2_mbox_loc_perm 0=3
Flatten          conv8_2_mbox_loc_flat 1 1 conv8_2_mbox_loc_perm conv8_2_mbox_loc_flat
Convolution      conv8_2_mbox_conf 1 1 conv8_2_conv8_2_relu_splitncnn_1 conv8_2_mbox_conf 0=84 1=3 2=1 3=1 4=1 5=1 6=193536
Permute          conv8_2_mbox_conf_perm 1 1 conv8_2_mbox_conf conv8_2_mbox_conf_perm 0=3
Flatten          conv8_2_mbox_conf_flat 1 1 conv8_2_mbox_conf_perm conv8_2_mbox_conf_flat
PriorBox         conv8_2_mbox_priorbox 2 1 conv8_2_conv8_2_relu_splitncnn_0 data_splitncnn_1 conv8_2_mbox_priorbox -23300=1,220.800003 -23301=1,278.399994 -23302=1,2.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=100.000000 12=100.000000 13=0.500000
Convolution      conv9_2_mbox_loc 1 1 conv9_2_conv9_2_relu_splitncnn_2 conv9_2_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=36864
Permute          conv9_2_mbox_loc_perm 1 1 conv9_2_mbox_loc conv9_2_mbox_loc_perm 0=3
Flatten          conv9_2_mbox_loc_flat 1 1 conv9_2_mbox_loc_perm conv9_2_mbox_loc_flat
Convolution      conv9_2_mbox_conf 1 1 conv9_2_conv9_2_relu_splitncnn_1 conv9_2_mbox_conf 0=84 1=3 2=1 3=1 4=1 5=1 6=193536
Permute          conv9_2_mbox_conf_perm 1 1 conv9_2_mbox_conf conv9_2_mbox_conf_perm 0=3
Flatten          conv9_2_mbox_conf_flat 1 1 conv9_2_mbox_conf_perm conv9_2_mbox_conf_flat
PriorBox         conv9_2_mbox_priorbox 2 1 conv9_2_conv9_2_relu_splitncnn_0 data_splitncnn_0 conv9_2_mbox_priorbox -23300=1,278.399994 -23301=1,336.000000 -23302=1,2.000000 3=0.100000 4=0.100000 5=0.200000 6=0.200000 7=1 8=0 9=-233 10=-233 11=300.000000 12=300.000000 13=0.500000
Concat           mbox_loc         6 1 conv4_1/sep_mbox_loc_flat conv5_5/sep_mbox_loc_flat conv6/sep_mbox_loc_flat conv7_2_mbox_loc_flat conv8_2_mbox_loc_flat conv9_2_mbox_loc_flat mbox_loc 0=0
Concat           mbox_conf        6 1 conv4_1/sep_mbox_conf_flat conv5_5/sep_mbox_conf_flat conv6/sep_mbox_conf_flat conv7_2_mbox_conf_flat conv8_2_mbox_conf_flat conv9_2_mbox_conf_flat mbox_conf 0=0
Concat           mbox_priorbox    6 1 conv4_1/sep_mbox_priorbox conv5_5/sep_mbox_priorbox conv6/sep_mbox_priorbox conv7_2_mbox_priorbox conv8_2_mbox_priorbox conv9_2_mbox_priorbox mbox_priorbox 0=1
Reshape          mbox_conf_reshape 1 1 mbox_conf mbox_conf_reshape 0=21 1=-1 2=0 3=0
Softmax          mbox_conf_softmax 1 1 mbox_conf_reshape mbox_conf_softmax 0=1
Flatten          mbox_conf_flatten 1 1 mbox_conf_softmax mbox_conf_flatten
DetectionOutput  detection_out    3 1 mbox_loc mbox_conf_flatten mbox_priorbox detection_out 0=21 1=0.450000 2=400 3=200 4=0.010000
